badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
#include "pmic.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "ch32v003fun.h"
#include "i2c_master.h"
#include "pmic_regs.h"

#define BQ25895_ADDR 0x6a

static pmic_result_t pmic_read_reg(uint8_t reg, uint8_t* out_value) {
    return (pm_i2c_read_reg(BQ25895_ADDR, reg, out_value, 1) == i2c_ok) ? pmic_ok : pmic_error;
}

static pmic_result_t pmic_write_reg(uint8_t reg, uint8_t value) {
    return (pm_i2c_write_reg(BQ25895_ADDR, reg, &value, 1) == i2c_ok) ? pmic_ok : pmic_error;
}

// REG00
pmic_result_t pmic_set_input_current_limit(uint16_t current, bool enable_ilim_pin, bool enable_hiz) {
    bq25895_reg00_t value = {0};

    if (current < 100) {  // Minimum current is 100 mA
        current = 100;
    }
    current -= 100;  // Offset is 100 mA

    value.en_hiz = enable_hiz;
    value.en_ilim = enable_ilim_pin;

    if (current >= 1600) {
        current -= 1600;
        value.iinlim |= (1 << 5);  // Add 1600 mA
    }
    if (current >= 800) {
        current -= 800;
        value.iinlim |= (1 << 4);  // Add 800 mA
    }
    if (current >= 400) {
        current -= 400;
        value.iinlim |= (1 << 3);  // Add 400 mA
    }
    if (current >= 200) {
        current -= 200;
        value.iinlim |= (1 << 2);  // Add 200 mA
    }
    if (current >= 100) {
        current -= 100;
        value.iinlim |= (1 << 1);  // Add 100 mA
    }
    if (current >= 50) {
        current -= 50;
        value.iinlim |= (1 << 0);  // Add 50 mA
    }

    return pmic_write_reg(0x00, value.raw);
}

pmic_result_t pmic_get_input_current_limit(uint16_t* out_current, bool* out_enable_ilim_pin, bool* out_enable_hiz) {
    bq25895_reg00_t value;
    pmic_result_t res = pmic_read_reg(0x00, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable_hiz) {
        *out_enable_hiz = value.en_hiz;
    }
    if (out_enable_ilim_pin) {
        *out_enable_ilim_pin = value.en_ilim;
    }
    if (out_current) {
        *out_current = 100;  // Offset is 100mA
        if (value.iinlim & (1 << 5)) *out_current += 1600;
        if (value.iinlim & (1 << 4)) *out_current += 800;
        if (value.iinlim & (1 << 3)) *out_current += 400;
        if (value.iinlim & (1 << 2)) *out_current += 200;
        if (value.iinlim & (1 << 1)) *out_current += 100;
        if (value.iinlim & (1 << 0)) *out_current += 50;
    }
    return pmic_ok;
}

// REG01
pmic_result_t pmic_set_input_voltage_limit_offset(uint8_t offset) {
    bq25895_reg01_t value = {0};
    pmic_result_t res = pmic_read_reg(0x01, &value.raw);
    if (res != pmic_ok) return res;
    value.vindpm_os = offset;
    return pmic_write_reg(0x01, value.raw);
}

pmic_result_t pmic_get_input_voltage_limit_offset(uint8_t* out_offset) {
    bq25895_reg01_t value = {0};
    pmic_result_t res = pmic_read_reg(0x01, &value.raw);
    if (res != pmic_ok) return res;
    if (out_offset) {
        *out_offset = value.vindpm_os;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_boost_mode_temperature_monitor_thresholds(bool cold, pmic_bhot_t hot) {
    bq25895_reg01_t value = {0};
    pmic_result_t res = pmic_read_reg(0x01, &value.raw);
    if (res != pmic_ok) return res;
    value.bcold = cold;
    value.bhot = (uint8_t)hot;
    return pmic_write_reg(0x01, value.raw);
}

pmic_result_t pmic_get_boost_mode_temperature_monitor_thresholds(bool* out_cold, pmic_bhot_t* out_hot) {
    bq25895_reg01_t value = {0};
    pmic_result_t res = pmic_read_reg(0x01, &value.raw);
    if (res != pmic_ok) return res;
    if (out_cold) {
        *out_cold = value.bcold;
    }
    if (out_hot) {
        *out_hot = (pmic_bhot_t)value.bhot;
    }
    return pmic_ok;
}

// REG02
pmic_result_t pmic_set_otg_boost_frequency(bool low_frequency) {
    // Low frequency: 500kHz, high frequency: 1.5MHz
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    value.boost_freq = low_frequency;
    return pmic_write_reg(0x02, value.raw);
}

pmic_result_t pmic_get_otg_boost_frequency(bool* out_low_frequency) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    if (out_low_frequency) {
        *out_low_frequency = value.boost_freq;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_input_current_optimizer(bool enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    value.ico_en = enable;
    return pmic_write_reg(0x02, value.raw);
}

pmic_result_t pmic_get_input_current_optimizer(bool* out_enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.ico_en;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_high_voltage_dcp(bool enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    value.hvdcp_en = enable;
    return pmic_write_reg(0x02, value.raw);
}

pmic_result_t pmic_get_high_voltage_dcp(bool* out_enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.hvdcp_en;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_maxcharge(bool enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    value.maxc_en = enable;
    return pmic_write_reg(0x02, value.raw);
}

pmic_result_t pmic_get_maxcharge(bool* out_enable) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.maxc_en;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_adc_configuration(bool start, bool continuous) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    value.conv_start = start;
    value.conv_rate = continuous;
    return pmic_write_reg(0x02, value.raw);
}

