badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
pmic_result_t pmic_get_adc_configuration(bool* out_busy, bool* out_continuous) {
    bq25895_reg02_t value;
    pmic_result_t res = pmic_read_reg(0x02, &value.raw);
    if (res != pmic_ok) return res;
    if (out_busy) {
        *out_busy = value.conv_start;
    }
    if (out_continuous) {
        *out_continuous = value.conv_rate;
    }
    return pmic_ok;
}

// REG03
pmic_result_t pmic_set_minimum_system_voltage_limit(uint16_t millivolt) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;

    value.sys_min = 0;

    if (millivolt < 3000) {
        millivolt = 3000;  // Minimum
    }
    millivolt -= 3000;  // Offset

    if (millivolt > 400) {
        millivolt -= 400;
        value.sys_min |= (1 << 2);
    }

    if (millivolt > 200) {
        millivolt -= 200;
        value.sys_min |= (1 << 1);
    }

    if (millivolt > 100) {
        millivolt -= 100;
        value.sys_min |= (1 << 0);
    }

    return pmic_write_reg(0x03, value.raw);
}

pmic_result_t pmic_get_minimum_system_voltage_limit(uint16_t* out_millivolt) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;

    uint16_t millivolt = 3000;

    if (value.sys_min & (1 << 2)) {
        millivolt += 400;
    }

    if (value.sys_min & (1 << 1)) {
        millivolt += 200;
    }

    if (value.sys_min & (1 << 0)) {
        millivolt += 100;
    }

    if (out_millivolt) {
        *out_millivolt = millivolt;
    }

    return pmic_ok;
}

pmic_result_t pmic_set_charge_enable(bool enable) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    value.chg_config = enable;
    return pmic_write_reg(0x03, value.raw);
}

pmic_result_t pmic_get_charge_enable(bool* out_enable) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.chg_config;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_otg_enable(bool enable) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    value.otg_config = enable;
    return pmic_write_reg(0x03, value.raw);
}

pmic_result_t pmic_get_otg_enable(bool* out_enable) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.otg_config;
    }
    return pmic_ok;
}

pmic_result_t pmic_reset_watchdog(void) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    value.wd_rst = true;
    return pmic_write_reg(0x03, value.raw);
}

pmic_result_t pmic_set_battery_load_enable(bool enable) {
    // Enabling this puts a 30mA load on the battery
    // for battery presence detection
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    value.bat_loaden = enable;
    return pmic_write_reg(0x03, value.raw);
}

pmic_result_t pmic_get_battery_load_enable(bool* out_enable) {
    bq25895_reg03_t value;
    pmic_result_t res = pmic_read_reg(0x03, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.bat_loaden;
    }
    return pmic_ok;
}

// REG04

pmic_result_t pmic_set_charge_current_fast(uint16_t current) {
    bq25895_reg04_t value;
    pmic_result_t res = pmic_read_reg(0x04, &value.raw);
    if (res != pmic_ok) return res;
    value.ichg = 0;
    if (current >= 4096) {
        current -= 4096;
        value.ichg |= (1 << 6);  // Add 4096mA
    }
    if (current >= 2048) {
        current -= 2048;
        value.ichg |= (1 << 5);  // Add 2048mA
    }
    if (current >= 1024) {
        current -= 1024;
        value.ichg |= (1 << 4);  // Add 1024mA
    }
    if (current >= 512) {
        current -= 512;
        value.ichg |= (1 << 3);  // Add 512mA
    }
    if (current >= 256) {
        current -= 256;
        value.ichg |= (1 << 2);  // Add 256mA
    }
    if (current >= 128) {
        current -= 128;
        value.ichg |= (1 << 1);  // Add 128mA
    }
    if (current >= 64) {
        current -= 64;
        value.ichg |= (1 << 0);  // Add 64mA
    }
    return pmic_write_reg(0x04, value.raw);
}

pmic_result_t pmic_get_fast_charge_current(uint16_t* out_current) {
    bq25895_reg04_t value;
    pmic_result_t res = pmic_read_reg(0x04, &value.raw);
    if (res != pmic_ok) return res;
    if (out_current) {
        uint16_t current = 0;
        if (value.ichg & (1 << 6)) {
            current += 4096;
        }
        if (value.ichg & (1 << 5)) {
            current += 2048;
        }
        if (value.ichg & (1 << 4)) {
            current += 1024;
        }
        if (value.ichg & (1 << 3)) {
            current += 512;
        }
        if (value.ichg & (1 << 2)) {
            current += 256;
        }
        if (value.ichg & (1 << 1)) {
            current += 128;
        }
        if (value.ichg & (1 << 0)) {
            current += 64;
        }
        *out_current = current;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_pumpx_enable(bool enable) {
    bq25895_reg04_t value;
    pmic_result_t res = pmic_read_reg(0x04, &value.raw);
    if (res != pmic_ok) return res;
    value.en_pumpx = enable;
    return pmic_write_reg(0x04, value.raw);
}

pmic_result_t pmic_get_pumpx_enable(bool* out_enable) {
    bq25895_reg04_t value;
    pmic_result_t res = pmic_read_reg(0x04, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.en_pumpx;
    }
    return pmic_ok;
}

// REG05
pmic_result_t pmic_set_termination_current(uint16_t current) {
    bq25895_reg05_t value;
    pmic_result_t res = pmic_read_reg(0x05, &value.raw);
    if (res != pmic_ok) return res;
    if (current < 64) {
        current = 64;
    }
    value.iterm = 0;
    current -= 64;  // Offset
    if (current > 512) {
        current -= 512;
        value.iterm |= (1 << 3);
    }
    if (current > 256) {
        current -= 256;
        value.iterm |= (1 << 2);
    }
    if (current > 128) {
        current -= 128;
        value.iterm |= (1 << 1);
    }
    if (current > 64) {
        current -= 64;
        value.iterm |= (1 << 0);
    }
    return pmic_write_reg(0x05, value.raw);
}

pmic_result_t pmic_get_termination_current(uint16_t* out_current) {
    bq25895_reg05_t value;
    pmic_result_t res = pmic_read_reg(0x05, &value.raw);
    if (res != pmic_ok) return res;
    if (out_current) {
        uint16_t current = 64;
        if (value.iterm & (1 << 3)) {
            current += 512;
        }
        if (value.iterm & (1 << 2)) {
            current += 256;
        }
        if (value.iterm & (1 << 1)) {
            current += 128;
        }
        if (value.iterm & (1 << 0)) {
            current += 64;
        }
        *out_current = current;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_precharge_current(uint16_t current) {
    bq25895_reg05_t value;
    pmic_result_t res = pmic_read_reg(0x05, &value.raw);
    if (current < 64) {
        current = 64;
    }
    value.iprechg = 0;
    current -= 64;  // Offset
    if (current > 512) {
        current -= 512;
        value.iprechg |= (1 << 3);
    }
    if (current > 256) {
        current -= 256;
        value.iprechg |= (1 << 2);
    }
    if (current > 128) {
        current -= 128;
        value.iprechg |= (1 << 1);
    }
    if (current > 64) {
        current -= 64;
        value.iprechg |= (1 << 0);
    }
    if (res != pmic_ok) return res;
    return pmic_write_reg(0x05, value.raw);
}

pmic_result_t pmic_get_precharge_current(uint16_t* out_current) {
    bq25895_reg05_t value;
    pmic_result_t res = pmic_read_reg(0x05, &value.raw);
    if (res != pmic_ok) return res;
    if (out_current) {
        uint16_t current = 64;
        if (value.iprechg & (1 << 3)) {
            current += 512;
        }
        if (value.iprechg & (1 << 2)) {
            current += 256;
        }
        if (value.iprechg & (1 << 1)) {
            current += 128;
        }
        if (value.iprechg & (1 << 0)) {
            current += 64;
        }
        *out_current = current;
    }
    return pmic_ok;
}

// REG06
pmic_result_t pmic_set_charge_recharge_threshold_200mv_offset(bool enable) {
    // Battery recharge threshold offset
    // 100mV below target voltage if disabled, 200mV if enabled
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    value.vrechg = enable;
    return pmic_write_reg(0x06, value.raw);
}

pmic_result_t pmic_get_charge_recharge_threshold_200mv_offset(bool* out_enable) {
    // Battery recharge threshold offset
    // 100mV below target voltage if disabled, 200mV if enabled
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.vrechg;
    }
    return pmic_ok;
}

