badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
pmic_result_t pmic_set_charge_battery_precharge_threshold_3v(bool enable) {
    // Threshold between precharge and fast charge
    // 2.8v if disabled, 3v if enabled
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    value.batlowv = enable;
    return pmic_write_reg(0x06, value.raw);
}

pmic_result_t pmic_get_charge_battery_precharge_threshold_3v(bool* out_enable) {
    // Threshold between precharge and fast charge
    // 2.8v if disabled, 3v if enabled
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.batlowv;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_charge_voltage_limit(uint16_t voltage) {
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    value.vreg = 0;
    if (voltage < 3840) {
        voltage = 3840;
    }
    voltage -= 3840;  // Offset
    if (voltage > 512) {
        voltage -= 512;
        value.vreg |= (1 << 5);
    }
    if (voltage > 256) {
        voltage -= 256;
        value.vreg |= (1 << 4);
    }
    if (voltage > 128) {
        voltage -= 128;
        value.vreg |= (1 << 3);
    }
    if (voltage > 64) {
        voltage -= 64;
        value.vreg |= (1 << 2);
    }
    if (voltage > 32) {
        voltage -= 32;
        value.vreg |= (1 << 1);
    }
    if (voltage > 16) {
        voltage -= 16;
        value.vreg |= (1 << 0);
    }
    return pmic_write_reg(0x06, value.raw);
}

pmic_result_t pmic_get_charge_voltage_limit(uint16_t* out_voltage) {
    bq25895_reg06_t value;
    pmic_result_t res = pmic_read_reg(0x06, &value.raw);
    if (res != pmic_ok) return res;
    if (out_voltage) {
        uint16_t voltage = 3840;
        if (value.vreg & (1 << 5)) {
            voltage += 512;
        }
        if (value.vreg & (1 << 4)) {
            voltage += 256;
        }
        if (value.vreg & (1 << 3)) {
            voltage += 128;
        }
        if (value.vreg & (1 << 2)) {
            voltage += 64;
        }
        if (value.vreg & (1 << 1)) {
            voltage += 32;
        }
        if (value.vreg & (1 << 0)) {
            voltage += 16;
        }
    }
    return pmic_ok;
}

// REG07
pmic_result_t pmic_set_charge_timer_limit(uint8_t hours) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    value.chg_timer = 0;
    if (hours >= 20) {
        value.chg_timer = 3;
    } else if (hours >= 12) {
        value.chg_timer = 2;
    } else if (hours >= 8) {
        value.chg_timer = 1;
    }
    return pmic_write_reg(0x07, value.raw);
}

pmic_result_t pmic_get_charge_timer_limit(uint8_t* out_hours) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (out_hours) {
        if (value.chg_timer == 1) {
            *out_hours = 8;
        } else if (value.chg_timer == 2) {
            *out_hours = 12;
        } else if (value.chg_timer == 3) {
            *out_hours = 20;
        } else {
            *out_hours = 5;
        }
    }
    if (res != pmic_ok) return res;
    return pmic_ok;
}

pmic_result_t pmic_set_charge_safety_timer_enable(bool enable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    value.en_timer = enable;
    return pmic_write_reg(0x07, value.raw);
}

pmic_result_t pmic_get_charge_safety_timer_enable(bool* out_enable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.en_timer;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_watchdog_timer_limit(uint8_t seconds) {
    // Set to zero to disable the watchdog timer
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    value.watchdog = 0;  // Disable
    if (seconds >= 160) {
        value.watchdog = 3;
    } else if (seconds >= 80) {
        value.watchdog = 2;
    } else if (seconds >= 40) {
        value.watchdog = 1;
    }
    return pmic_write_reg(0x07, value.raw);
}

pmic_result_t pmic_get_watchdog_timer_limit(uint8_t* out_seconds) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    if (out_seconds) {
        if (value.watchdog == 1) {
            *out_seconds = 40;
        } else if (value.watchdog == 2) {
            *out_seconds = 80;
        } else if (value.watchdog == 3) {
            *out_seconds = 160;
        } else {
            *out_seconds = 0;
        }
    }
    return pmic_ok;
}

pmic_result_t pmic_set_status_pin_disable(bool disable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    value.stat_dis = disable;
    return pmic_write_reg(0x07, value.raw);
}

pmic_result_t pmic_get_status_pin_disable(bool* out_disable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    if (out_disable) {
        *out_disable = value.stat_dis;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_charge_termination_enable(bool enable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    value.en_term = enable;
    return pmic_write_reg(0x07, value.raw);
}

pmic_result_t pmic_get_charge_termination_enable(bool* out_enable) {
    bq25895_reg07_t value;
    pmic_result_t res = pmic_read_reg(0x07, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.en_term;
    }
    return pmic_ok;
}

// REG08
pmic_result_t pmic_set_thermal_regulation_threshold(uint8_t temperature) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    value.treg = 0;  // 60 degrees
    if (temperature >= 120) {
        value.treg = 3;
    } else if (temperature >= 100) {
        value.treg = 2;
    } else if (temperature >= 80) {
        value.treg = 1;
    }
    return pmic_write_reg(0x08, value.raw);
}

pmic_result_t pmic_get_thermal_regulation_threshold(uint8_t* out_temperature) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    if (out_temperature) {
        if (value.treg == 1) {
            *out_temperature = 80;
        } else if (value.treg == 2) {
            *out_temperature = 100;
        } else if (value.treg == 3) {
            *out_temperature = 120;
        } else {
            *out_temperature = 60;
        }
    }
    return pmic_ok;
}

