badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
pmic_result_t pmic_set_ir_compensation_voltage_clamp(uint16_t millivolt) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    value.vclamp = 0;
    if (millivolt >= 128) {
        millivolt -= 128;
        value.vclamp |= (1 << 2);
    }
    if (millivolt >= 64) {
        millivolt -= 64;
        value.vclamp |= (1 << 1);
    }
    if (millivolt >= 32) {
        millivolt -= 32;
        value.vclamp |= (1 << 0);
    }
    return pmic_write_reg(0x08, value.raw);
}

pmic_result_t pmic_get_ir_compensation_voltage_clamp(uint16_t* out_millivolt) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    if (out_millivolt) {
        *out_millivolt = 0;
        if (value.vclamp & (1 << 2)) {
            *out_millivolt += 128;
        }
        if (value.vclamp & (1 << 1)) {
            *out_millivolt += 64;
        }
        if (value.vclamp & (1 << 0)) {
            *out_millivolt += 32;
        }
    }
    return pmic_ok;
}

pmic_result_t pmic_set_ir_compensation_resistor_setting(uint16_t milliohm) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    value.bat_comp = 0;
    if (milliohm >= 80) {
        milliohm -= 80;
        value.bat_comp |= (1 << 2);
    }
    if (milliohm >= 40) {
        milliohm -= 40;
        value.bat_comp |= (1 << 1);
    }
    if (milliohm >= 20) {
        milliohm -= 20;
        value.bat_comp |= (1 << 0);
    }
    return pmic_write_reg(0x08, value.raw);
}

pmic_result_t pmic_get_ir_compensation_resistor_setting(uint16_t* out_milliohm) {
    bq25895_reg08_t value;
    pmic_result_t res = pmic_read_reg(0x08, &value.raw);
    if (res != pmic_ok) return res;
    if (out_milliohm) {
        *out_milliohm = 0;
        if (value.bat_comp & (1 << 2)) {
            *out_milliohm += 80;
        }
        if (value.bat_comp & (1 << 1)) {
            *out_milliohm += 40;
        }
        if (value.bat_comp & (1 << 0)) {
            *out_milliohm += 20;
        }
    }
    return pmic_ok;
}

// REG09
pmic_result_t pmic_set_pumpx_down_enable(bool enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.pumpx_dn = enable;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_pumpx_down_enable(bool* out_enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.pumpx_dn;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_pumpx_up_enable(bool enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.pumpx_up = enable;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_pumpx_up_enable(bool* out_enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.pumpx_up;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_battery_full_system_reset_enable(bool enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.batfet_rst_en = enable;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_battery_full_system_reset_enable(bool* out_enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.batfet_rst_en;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_battery_disconnect_delay_enable(bool enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.batfet_dly = enable;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_battery_disconnect_delay_enable(bool* out_enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.batfet_dly;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_battery_disconnect_enable(bool disconnect) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.batfet_dis = disconnect;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_battery_disconnect_enable(bool* out_disconnected) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_disconnected) {
        *out_disconnected = value.batfet_dis;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_safety_timer_slow_2x_enable(bool enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.tmr2x_en = enable;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_safety_timer_slow_2x_enable(bool* out_enable) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_enable) {
        *out_enable = value.tmr2x_en;
    }
    return pmic_ok;
}

pmic_result_t pmic_set_force_ico_enable(bool force) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    value.force_ico = force;
    return pmic_write_reg(0x09, value.raw);
}

pmic_result_t pmic_get_force_ico_enable(bool* out_forced) {
    bq25895_reg09_t value;
    pmic_result_t res = pmic_read_reg(0x09, &value.raw);
    if (res != pmic_ok) return res;
    if (out_forced) {
        *out_forced = value.force_ico;
    }
    return pmic_ok;
}

// REG0A
pmic_result_t pmic_set_boost_mode_voltage(uint16_t millivolt) {
    bq25895_reg0A_t value;
    pmic_result_t res = pmic_read_reg(0x0A, &value.raw);
    if (res != pmic_ok) return res;
    value.boostv = 0;
    if (millivolt < 4550) {
        millivolt = 4550;
    }
    millivolt -= 4550;  // Offset
    if (millivolt >= 512) {
        millivolt -= 512;
        value.boostv |= (1 << 3);
    }
    if (millivolt >= 256) {
        millivolt -= 256;
        value.boostv |= (1 << 2);
    }
    if (millivolt >= 128) {
        millivolt -= 128;
        value.boostv |= (1 << 1);
    }
    if (millivolt >= 64) {
        millivolt -= 64;
        value.boostv |= (1 << 0);
    }
    return pmic_write_reg(0x0A, value.raw);
}

