badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
pmic_result_t pmic_get_boost_mode_voltage(uint16_t* out_millivolt) {
    bq25895_reg0A_t value;
    pmic_result_t res = pmic_read_reg(0x0A, &value.raw);
    if (res != pmic_ok) return res;
    if (out_millivolt) {
        *out_millivolt = 4550;
        if (value.boostv & (1 << 3)) {
            *out_millivolt += 512;
        }
        if (value.boostv & (1 << 2)) {
            *out_millivolt += 256;
        }
        if (value.boostv & (1 << 1)) {
            *out_millivolt += 128;
        }
        if (value.boostv & (1 << 0)) {
            *out_millivolt += 64;
        }
    }
    return pmic_ok;
}

// REG0B
pmic_result_t pmic_get_vsys_regulation_status(bool* out_active) {
    bq25895_reg0B_t value;
    pmic_result_t res = pmic_read_reg(0x0B, &value.raw);
    if (res != pmic_ok) return res;
    if (out_active) {
        *out_active = value.vsys_stat;
    }
    return pmic_ok;
}

pmic_result_t pmic_get_usb_input_sdp_status(bool* out_usb500) {
    bq25895_reg0B_t value;
    pmic_result_t res = pmic_read_reg(0x0B, &value.raw);
    if (res != pmic_ok) return res;
    if (out_usb500) {
        *out_usb500 = value.sdp_stat;
    }
    return pmic_ok;
}

pmic_result_t pmic_get_power_good_status(bool* out_active) {
    bq25895_reg0B_t value;
    pmic_result_t res = pmic_read_reg(0x0B, &value.raw);
    if (res != pmic_ok) return res;
    if (out_active) {
        *out_active = value.pg_stat;
    }
    return pmic_ok;
}

pmic_result_t pmic_get_charging_status(pmic_charge_status_t* out_status) {
    bq25895_reg0B_t value;
    pmic_result_t res = pmic_read_reg(0x0B, &value.raw);
    if (res != pmic_ok) return res;
    if (out_status) {
        *out_status = (pmic_charge_status_t)value.chrg_stat;
    }
    return pmic_ok;
}

pmic_result_t pmic_get_vbus_status(pmic_vbus_status_t* out_status) {
    bq25895_reg0B_t value;
    pmic_result_t res = pmic_read_reg(0x0B, &value.raw);
    if (res != pmic_ok) return res;
    if (out_status) {
        *out_status = (pmic_vbus_status_t)value.vbus_stat;
    }
    return pmic_ok;
}

// REG0C
pmic_result_t pmic_get_faults(uint8_t* out_raw, pmic_faults_t* out_faults) {
    bq25895_reg0C_t value = {0};
    pmic_result_t res = pmic_read_reg(0x0C, &value.raw);
    if (res != pmic_ok) return res;

    if (out_raw) {
        *out_raw = value.raw;
    }

    if (out_faults) {
        out_faults->watchdog = value.watchdog_fault;
        out_faults->boost = value.boost_fault;
        out_faults->chrg_input = value.chrg_fault == 1;
        out_faults->chrg_thermal = value.chrg_fault == 2;
        out_faults->chrg_safety = value.chrg_fault == 3;
        out_faults->batt_ovp = value.bat_fault;
        out_faults->ntc_cold = (value.ntc_fault & 3) == 1;
        out_faults->ntc_hot = (value.ntc_fault & 3) == 2;
        out_faults->ntc_boost = (value.ntc_fault >> 2) & 1;
    }

    return pmic_ok;
}

// REG0D
pmic_result_t pmic_set_vindpm(uint16_t millivolt) {
    bq25895_reg0D_t value;
    pmic_result_t res = pmic_read_reg(0x0D, &value.raw);
    if (res != pmic_ok) return res;
    value.vindpm = 0;
    if (millivolt < 2600) {
        millivolt = 2600;
    }
    millivolt -= 2600;
    if (millivolt >= 6400) {
        millivolt -= 6400;
        value.vindpm |= (1 << 6);
    }
    if (millivolt >= 3200) {
        millivolt -= 3200;
        value.vindpm |= (1 << 5);
    }
    if (millivolt >= 1600) {
        millivolt -= 1600;
        value.vindpm |= (1 << 4);
    }
    if (millivolt >= 800) {
        millivolt -= 800;
        value.vindpm |= (1 << 3);
    }
    if (millivolt >= 400) {
        millivolt -= 400;
        value.vindpm |= (1 << 2);
    }
    if (millivolt >= 200) {
        millivolt -= 200;
        value.vindpm |= (1 << 1);
    }
    if (millivolt >= 100) {
        millivolt -= 100;
        value.vindpm |= (1 << 0);
    }
    return pmic_write_reg(0x0D, value.raw);
}

pmic_result_t pmic_get_vindpm(uint16_t* out_millivolt) {
    bq25895_reg0D_t value;
    pmic_result_t res = pmic_read_reg(0x0D, &value.raw);
    if (res != pmic_ok) return res;
    if (out_millivolt) {
        *out_millivolt = 2600;
        if (value.vindpm & (1 << 6)) {
            *out_millivolt += 6400;
        }
        if (value.vindpm & (1 << 5)) {
            *out_millivolt += 3200;
        }
        if (value.vindpm & (1 << 4)) {
            *out_millivolt += 1600;
        }
        if (value.vindpm & (1 << 3)) {
            *out_millivolt += 800;
        }
        if (value.vindpm & (1 << 2)) {
            *out_millivolt += 400;
        }
        if (value.vindpm & (1 << 1)) {
            *out_millivolt += 200;
        }
        if (value.vindpm & (1 << 0)) {
            *out_millivolt += 100;
        }
    }
    return pmic_ok;
}

pmic_result_t pmic_set_force_vindpm(bool absolute) {
    bq25895_reg0D_t value;
    pmic_result_t res = pmic_read_reg(0x0D, &value.raw);
    if (res != pmic_ok) return res;
    value.force_vindpm = absolute;
    return pmic_write_reg(0x0D, value.raw);
}

pmic_result_t pmic_get_force_vindpm(bool* out_absolute) {
    bq25895_reg0D_t value;
    pmic_result_t res = pmic_read_reg(0x0D, &value.raw);
    if (res != pmic_ok) return res;
    if (out_absolute) {
        *out_absolute = value.force_vindpm;
    }
    return pmic_ok;
}

// REG0E
pmic_result_t pmic_get_adc_vbat(uint16_t* out_vbat, bool* out_therm_stat) {
    bq25895_reg0E_t value;
    pmic_result_t res = pmic_read_reg(0x0E, &value.raw);
    if (res != pmic_ok) return res;

    if (out_vbat) {
        uint16_t vbat = 2304;
        if ((value.vbat >> 6) & 1) vbat += 1280;
        if ((value.vbat >> 5) & 1) vbat += 640;
        if ((value.vbat >> 4) & 1) vbat += 320;
        if ((value.vbat >> 3) & 1) vbat += 160;
        if ((value.vbat >> 2) & 1) vbat += 80;
        if ((value.vbat >> 1) & 1) vbat += 40;
        if ((value.vbat >> 0) & 1) vbat += 20;
        *out_vbat = vbat;
    }

    if (out_therm_stat) {
        *out_therm_stat = value.therm_stat;
    }

    return pmic_ok;
}

pmic_result_t pmic_get_thermal_regulation_status(bool* out_therm_stat) {
    bq25895_reg0E_t value;
    pmic_result_t res = pmic_read_reg(0x0E, &value.raw);
    if (res != pmic_ok) return res;
    if (out_therm_stat) {
        *out_therm_stat = value.therm_stat;
    }
    return pmic_ok;
}

// REG0F
pmic_result_t pmic_get_adc_vsys(uint16_t* out_vsys) {
    bq25895_reg0F_t value;
    pmic_result_t res = pmic_read_reg(0x0F, &value.raw);
    if (res != pmic_ok) return res;

    if (out_vsys) {
        uint16_t vsys = 2304;
        if ((value.vsys >> 6) & 1) vsys += 1280;
        if ((value.vsys >> 5) & 1) vsys += 640;
        if ((value.vsys >> 4) & 1) vsys += 320;
        if ((value.vsys >> 3) & 1) vsys += 160;
        if ((value.vsys >> 2) & 1) vsys += 80;
        if ((value.vsys >> 1) & 1) vsys += 40;
        if ((value.vsys >> 0) & 1) vsys += 20;
        *out_vsys = vsys;
    }

    return pmic_ok;
}

// REG10
pmic_result_t pmic_get_adc_tspct(uint16_t* out_tspct) {
    // Divide the output of this function by 100 to get the percentage
    bq25895_reg10_t value;
    pmic_result_t res = pmic_read_reg(0x10, &value.raw);
    if (res != pmic_ok) return res;

    if (out_tspct) {
        uint16_t tspct = 2100;
        if ((value.tspct >> 6) & 1) tspct += 2976;
        if ((value.tspct >> 5) & 1) tspct += 1488;
        if ((value.tspct >> 4) & 1) tspct += 744;
        if ((value.tspct >> 3) & 1) tspct += 372;
        if ((value.tspct >> 2) & 1) tspct += 186;
        if ((value.tspct >> 1) & 1) tspct += 93;
        if ((value.tspct >> 0) & 1) tspct += 47;
        *out_tspct = tspct;
    }

    return pmic_ok;
}

// REG11
pmic_result_t pmic_get_adc_vbus(uint16_t* out_vbus, bool* out_vbus_gd) {
    bq25895_reg11_t value;
    pmic_result_t res = pmic_read_reg(0x11, &value.raw);
    if (res != pmic_ok) return res;

    if (out_vbus) {
        uint16_t vbus = 2600;
        if ((value.vbus >> 6) & 1) vbus += 6400;
        if ((value.vbus >> 5) & 1) vbus += 3200;
        if ((value.vbus >> 4) & 1) vbus += 1600;
        if ((value.vbus >> 3) & 1) vbus += 800;
        if ((value.vbus >> 2) & 1) vbus += 400;
        if ((value.vbus >> 1) & 1) vbus += 200;
        if ((value.vbus >> 0) & 1) vbus += 100;
        *out_vbus = vbus;
    }

    if (out_vbus_gd) {
        *out_vbus_gd = value.vbus_gd;
    }

    return pmic_ok;
}

