badgeteam/why2025-firmware-ch32v203/src/application/pmic.c
pmic_result_t pmic_get_vbus_good(bool* out_vbus_gd) {
    bq25895_reg11_t value;
    pmic_result_t res = pmic_read_reg(0x11, &value.raw);
    if (res != pmic_ok) return res;
    if (out_vbus_gd) {
        *out_vbus_gd = value.vbus_gd;
    }
    return pmic_ok;
}

// REG12
pmic_result_t pmic_get_adc_ichgr(uint16_t* out_ichgr) {
    bq25895_reg12_t value;
    pmic_result_t res = pmic_read_reg(0x12, &value.raw);
    if (res != pmic_ok) return res;

    if (out_ichgr) {
        uint16_t ichgr = 0;
        if ((value.ichgr >> 6) & 1) ichgr += 3200;
        if ((value.ichgr >> 5) & 1) ichgr += 1600;
        if ((value.ichgr >> 4) & 1) ichgr += 800;
        if ((value.ichgr >> 3) & 1) ichgr += 400;
        if ((value.ichgr >> 2) & 1) ichgr += 200;
        if ((value.ichgr >> 1) & 1) ichgr += 100;
        if ((value.ichgr >> 0) & 1) ichgr += 50;
        *out_ichgr = ichgr;
    }

    return pmic_ok;
}

/////////////////////////////

pmic_result_t pmic_power_off() {
    pmic_result_t res;
    res = pmic_get_watchdog_timer_limit(0);
    if (res != pmic_ok) return res;
    res = pmic_set_adc_configuration(false, false);
    if (res != pmic_ok) return res;
    res = pmic_set_otg_enable(false);
    if (res != pmic_ok) return res;
    res = pmic_set_battery_load_enable(false);
    if (res != pmic_ok) return res;
    res = pmic_set_battery_disconnect_enable(true);
    return res;
}

pmic_result_t pmic_battery_attached(bool* battery_attached, bool detect_empty_battery) {
    pmic_result_t res;
    *battery_attached = false;
    uint16_t vbatt = 0;
    bool therm_stat = false;

    // Algorithm 1: detect battery with normal voltage
    res = pmic_set_charge_enable(false);  // Disable charging
    if (res != pmic_ok) return res;
    res = pmic_set_battery_load_enable(true);  // Apply 30mA load on battery
    if (res != pmic_ok) return res;
    Delay_Ms(5);                                // Wait 5ms
    res = pmic_set_battery_load_enable(false);  // Disable 30mA load on battery
    if (res != pmic_ok) return res;
    res = pmic_get_adc_vbat(&vbatt, &therm_stat);  // Measure battery voltage
    if (res != pmic_ok) return res;
    if (vbatt >= 3000 && (!therm_stat)) {  // Assume attached if battery voltage 3v or higher
        *battery_attached = true;
        return res;
    } else if (therm_stat) {  // Battery temperature too high, ignore battery even if attached
        return res;
    }

    // Algorithm 2: detect empty battery by forcing closing of protection circuit
    if (detect_empty_battery) {
        res = pmic_set_minimum_system_voltage_limit(3700);  // Set minimum system voltage to 3.7v
        if (res != pmic_ok) return res;
        res = pmic_set_charge_voltage_limit(3700);  // Set charging end voltage to 3.7v
        if (res != pmic_ok) return res;
        res = pmic_set_charge_enable(true);  // Enable charging
        Delay_Ms(50);                        // Wait 50ms
        if (res != pmic_ok) return res;
        res = pmic_set_charge_enable(false);  // Disable charging
        if (res != pmic_ok) return res;
        res = pmic_set_battery_load_enable(true);  // Apply 30mA load on battery
        if (res != pmic_ok) return res;
        Delay_Ms(5);                                // Wait 5ms
        res = pmic_set_battery_load_enable(false);  // Disable 30mA load on battery
        if (res != pmic_ok) return res;
        res = pmic_get_adc_vbat(&vbatt, &therm_stat);  // Measure battery voltage
        if (res != pmic_ok) return res;
        res = pmic_set_minimum_system_voltage_limit(3500);  // Set minimum system voltage back to the default 3.5v
        if (res != pmic_ok) return res;
        if (vbatt >= 2800 && (!therm_stat)) {  // Assume attached if battery voltage 2.8v or higher
            *battery_attached = true;
            return res;
        }
    }

    return res;
}

pmic_result_t pmic_configure_battery_charger(bool enable) {
    pmic_result_t res;
    res = pmic_set_battery_load_enable(false);  // Disable 30mA load on battery
    if (res != pmic_ok) return res;
    if (enable) {
        res = pmic_set_charge_voltage_limit(4200);  // Charge up to 4.2v
        if (res != pmic_ok) return res;
        res = pmic_set_charge_current_fast(2048);  // Charge at 2A maximum current
        if (res != pmic_ok) return res;
        res = pmic_set_charge_enable(true);  // Start charging
    } else {
        res = pmic_set_charge_enable(false);  // Stop charging
    }
    return res;
}
